import { defineConfig } from 'vitepress'

// https://vitepress.dev/reference/site-config
export default defineConfig({
  title: "后端文档",
  description: "A VitePress Site",
  srcDir: 'src',
  themeConfig: {
    // https://vitepress.dev/reference/default-theme-config
    nav: [
      // { text: 'Home', link: '/' },
      { 
        text: '程序语言',
        items: [
          { text: 'node.js', link: '/程序语言/node.js/实践/实践' },
          { text: 'Java', link: '/程序语言/Java技术栈/Java/狂神教程/JavaWeb/Web概念' },
        ]
      },
      { text: '数据库', link: '/数据库/表相关/表结构' },
      { text: '系统操作', link: '/系统操作/脚本/bash/文档笔记' },
      { text: '工具使用', link: '/工具使用/Postman/index' },
      { text: '娱乐', link: '/娱乐/1' },
    ],

    sidebar: {
      '/程序语言/': [
        {
          text: 'node.js',
          collapsed: true,
          items: [
            {
              text: '实践',
              items: [
                { text: '实践', link: '/程序语言/node.js/实践/实践' },
                { text: '本地oss上传', link: '/程序语言/node.js/实践/本地oss上传' },
              ]
            },
            {
              text: '框架',
              items: [
                {
                  text: 'express',
                  items: [
                    { text: '简单示例', link: '/程序语言/node.js/框架/express/简单示例' },
                  ]
                },
              ]
            },
            {
              text: '学习',
              items: [
                { text: '认识', link: '/程序语言/node.js/学习/认识' },
                { text: '认识模块', link: '/程序语言/node.js/学习/认识模块' },
                { text: 'express', link: '/程序语言/node.js/学习/express' },
                { text: '连接数据库', link: '/程序语言/node.js/学习/连接数据库' },
              ]
            },
            {
              text: '学习-co',
              items: [
                { text: 'co1-node基础', link: '/程序语言/node.js/学习-co/co1-node基础' },
                { text: 'co2-实现脚手架', link: '/程序语言/node.js/学习-co/co2-实现脚手架' },
                { text: 'co3-服务器', link: '/程序语言/node.js/学习-co/co3-服务器' },
                { text: 'co4-mysql', link: '/程序语言/node.js/学习-co/co4-mysql' },
                { text: 'co5-项目', link: '/程序语言/node.js/学习-co/co5-项目' },
                { text: 'co6-补充', link: '/程序语言/node.js/学习-co/co6-补充' },
              ]
            },
          ]
        },
        {
          text: 'Java技术栈',
          collapsed: true,
          items: [
            {
              text: 'Java',
              items: [
                { text: '其它', link: '/程序语言/Java技术栈/Java/其它' },
                {
                  text: '菜鸟',
                  items: [
                    { text: '基础-第一部分', link: '/程序语言/Java技术栈/Java/菜鸟/基础-第一部分' },
                    { text: '日期-第二部分', link: '/程序语言/Java技术栈/Java/菜鸟/日期-第二部分' },
                  ]
                },
                {
                  text: '狂神教程',
                  items: [
                    { 
                      text: 'JavaSE',
                      items: [
                        {  text: 'JavaSE-入门', link: '/程序语言/Java技术栈/Java/狂神教程/JavaSE/JavaSE-入门'},
                        {  text: 'JavaSE-流程控制', link: '/程序语言/Java技术栈/Java/狂神教程/JavaSE/JavaSE-流程控制'},
                        {  text: 'Java基础-注解', link: '/程序语言/Java技术栈/Java/狂神教程/JavaSE/Java基础-注解'},
                        {  text: 'Java基础-多线程', link: '/程序语言/Java技术栈/Java/狂神教程/JavaSE/Java基础-多线程'},
                      ]
                    },
                    { 
                      text: 'JavaWeb',
                      items: [
                        {  text: 'Web概念', link: '/程序语言/Java技术栈/Java/狂神教程/JavaWeb/Web概念'},
                        {  text: '项目', link: '/程序语言/Java技术栈/Java/狂神教程/JavaWeb/项目'},
                      ]
                    },
                    { 
                      text: 'SSM框架',
                      items: [
                        {  text: 'Spring', link: '/程序语言/Java技术栈/Java/狂神教程/SSM框架/Spring'},
                        {  text: 'SpringMVC', link: '/程序语言/Java技术栈/Java/狂神教程/SSM框架/SpringMVC'},
                        {  text: 'MyBatis', link: '/程序语言/Java技术栈/Java/狂神教程/SSM框架/MyBatis'},
                      ]
                    },
                    { 
                      text: '微服务开发',
                      items: [
                        {  text: 'SpringBoot', link: '/程序语言/Java技术栈/Java/狂神教程/微服务开发/SpringBoot'},
                        {  text: 'MybatisPlus', link: '/程序语言/Java技术栈/Java/狂神教程/微服务开发/MybatisPlus'},
                      ]
                    },
                  ]
                },
              ]
            },
          ]
        },
      ],
      '/系统操作/': [
        { 
          text: '脚本', 
          items: [
            { 
              text: 'bash', 
              items: [
                { text: '文档笔记', link: '/系统操作/脚本/bash/文档笔记' },
                { text: '补充知识', link: '/系统操作/脚本/bash/补充知识' },
                { text: '示例', link: '/系统操作/脚本/bash/示例' },
                { text: '实例', link: '/系统操作/脚本/bash/实例' },
              ]
            },
          ]
        },
        { text: 'Window', link: '/系统操作/Window/index' },
        { text: 'Linux', link: '/系统操作/Linux/index' },
      ],
      '/数据库/': [
        {
          text: '表相关',
          items: [
            { text: '表结构', link: '/数据库/表相关/表结构' },
            { text: '数据库设计常见表设计分析', link: '/数据库/表相关/数据库设计常见表设计分析' },
          ]
        },
        {
          text: 'MongoDB',
          items: [
            { text: '入门', link: '/数据库/MongoDB/入门' },
          ]
        },
        {
          text: 'MySQL',
          items: [
            { text: 'SQL语句', link: '/数据库/MySQL/SQL语句' },
            { text: '实际应用', link: '/数据库/MySQL/实际应用' },
            {
              text: '学习-黑', 
              items: [
                { text: '基础', link: '/数据库/MySQL/学习-黑/基础' },
                { text: '进阶', link: '/数据库/MySQL/学习-黑/进阶' },
              ]
            },
          ]
        },
      ],
      '/工具使用/': [
        {
          text: '工具使用',
          items: [
            { text: 'Postman', link: '/工具使用/Postman/index' },
          ]
        },
      ],
      '/娱乐/': [
        { text: '1', link: '/娱乐/1' },
        { text: '待处理', link: '/娱乐/待处理' },
        { text: 'music', link: '/娱乐/music' },
      ],
    },

    socialLinks: [
      { icon: 'github', link: 'https://github.com/SpringLoach/SpringLoach.github.io' },
      { 
        icon: {
          svg: '<svg t="1717035375440" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1841" width="200" height="200"><path d="M125.3376 645.7856a52.2752 52.2752 0 0 1-5.8368-60.1088c23.296-41.6768 59.0336-90.5728 103.3728-141.4144a20.48 20.48 0 1 0-30.72-26.9312c-32.1536 36.9152-77.1072 92.6208-108.2368 148.48a94.0544 94.0544 0 0 0 10.5472 106.8032 1157.12 1157.12 0 0 0 84.5824 88.9344 20.48 20.48 0 0 0 28.0576-29.9008 1103.8208 1103.8208 0 0 1-81.7664-85.8624zM271.36 786.2272l-8.2944-6.3488a20.48 20.48 0 1 0-25.1904 32.256l8.7552 6.7584a20.48 20.48 0 0 0 24.7296-32.6656zM911.0016 719.5136a379.1872 379.1872 0 0 1-34.6112-119.0912v-0.6144-0.9728a342.1184 342.1184 0 0 1 26.368-171.9296 45.312 45.312 0 0 0-9.8304-49.9712 44.4928 44.4928 0 0 0-49.0496-9.5232C805.2736 384 769.8432 414.208 728.8832 465.92a20.48 20.48 0 1 0 32.1536 25.6c36.4544-46.08 66.9184-72.8064 98.7648-86.3744a3.2256 3.2256 0 0 1 4.0448 0.8704 4.2496 4.2496 0 0 1 1.024 5.12 406.2208 406.2208 0 0 0-26.9312 93.0304 215.552 215.552 0 0 0-100.352 48.4864 20.48 20.48 0 0 0 26.9824 30.72 173.312 173.312 0 0 1 68.9664-36.2496 440.32 440.32 0 0 0 0 35.84l-56.7808 5.12a20.48 20.48 0 0 0 1.792 40.96h1.8944l57.5488-5.12a407.4496 407.4496 0 0 0 12.288 51.9168c-54.272-15.36-85.0944-40.96-85.8112-41.6768a20.48 20.48 0 0 0-26.8288 30.976c1.9968 1.7408 48.3328 40.96 129.6896 56.7808 2.2528 5.12 4.4544 10.24 6.912 15.36l0.6656 1.2288c7.2704 13.0048 12.8 30.72-2.048 42.5472-13.2608 10.24-38.5024 12.1344-53.6064-1.9456-37.632-35.072-90.8288-118.9888-91.392-119.8592a20.48 20.48 0 0 0-17.152-9.5232 20.1216 20.1216 0 0 0-17.3056 9.3184c-0.7168 1.024-68.608 104.0896-171.3152 142.2848a20.48 20.48 0 0 0-4.8128 35.84 386.2528 386.2528 0 0 0 56.6784 33.792c-48.3328 13.9776-137.7792 20.1728-258.9696-55.1424a20.48 20.48 0 0 0-21.6576 34.7648c87.04 54.1696 160.4096 70.2464 216.7296 70.2464 79.7184 0 125.5424-32.2048 128.7168-34.5088a20.48 20.48 0 0 0-6.8608-36.4032 282.112 282.112 0 0 1-59.8016-25.6c65.0752-34.0992 113.0496-86.784 137.472-117.76 19.7632 29.2352 53.6576 76.8 81.92 103.0656a84.9408 84.9408 0 0 0 106.8032 4.1472c21.7088-17.3056 36.5056-50.8928 12.6976-94.2592z" p-id="1842"></path><path d="M234.0864 400.9472a20.48 20.48 0 0 0 28.9792-0.6144C311.296 349.952 357.376 310.1184 386.2016 293.888c47.872-26.9824 166.3488-27.8016 247.3472 11.5712a3.4304 3.4304 0 0 1 1.9968 2.816 3.2768 3.2768 0 0 1-1.4336 3.1232C570.7264 358.4 537.6 376.1664 537.088 376.32a20.48 20.48 0 0 0 0 36.4032c0.9728 0.512 95.7952 49.4592 148.48 133.8368a20.48 20.48 0 0 0 17.3568 9.6256 20.1728 20.1728 0 0 0 10.8544-3.1232 20.48 20.48 0 0 0 6.5024-28.2112C680.96 461.7728 622.2848 417.3824 586.5984 394.24c16.9984-10.8544 40.96-27.0848 71.9872-50.0736a44.4928 44.4928 0 0 0-7.1168-75.6736c-87.04-42.1888-220.16-47.0528-285.3376-10.24C333.4656 276.48 285.1328 318.0544 233.472 372.0192a20.48 20.48 0 0 0 0.6144 28.928zM331.9296 564.8896a62.4128 62.4128 0 1 0-62.3616 62.3616 62.464 62.464 0 0 0 62.3616-62.3616z m-83.8144 0a21.4528 21.4528 0 1 1 21.4528 21.4016 21.504 21.504 0 0 1-21.4528-21.4016zM358.0416 710.1952a302.08 302.08 0 0 1-14.0288 35.84 20.48 20.48 0 0 0 9.8816 27.0848 20.7872 20.7872 0 0 0 8.6528 1.8944 20.48 20.48 0 0 0 18.5856-11.776 346.2144 346.2144 0 0 0 15.9232-40.96 20.48 20.48 0 1 0-39.0144-12.4416zM410.4704 661.504c0.3584-2.8672 0.7168-5.7344 0.9728-8.6528a20.48 20.48 0 1 0-40.96-4.096c-0.256 2.5088-0.5632 5.12-0.8704 7.6288a20.48 20.48 0 0 0 17.7664 22.8864 22.3232 22.3232 0 0 0 2.6112 0 20.48 20.48 0 0 0 20.48-17.7664z" p-id="1843"></path><path d="M366.1824 418.2016a20.48 20.48 0 0 0-35.84 19.6608 412.9792 412.9792 0 0 1 41.472 153.6 20.48 20.48 0 0 0 20.48 19.1488h1.3312a20.48 20.48 0 0 0 18.944-21.8112 446.5664 446.5664 0 0 0-46.3872-170.5984zM201.5232 340.5824a19.2 19.2 0 0 0 5.632 0.8192 20.48 20.48 0 0 0 5.5808-40.192c-28.672-8.192-31.744-16.4352-31.7952-16.4864-0.3072-2.048 4.2496-9.3184 11.52-14.336 17.7664-12.288 50.8416-35.1232 57.856-73.4208 8.96-48.896-37.7344-73.3184-63.744-79.2064a20.48 20.48 0 0 0-9.4208 39.8848c1.536 0.3584 37.0688 9.3184 32.8704 32.1536-3.6352 19.9168-22.9888 34.7648-40.96 47.104-5.6832 3.8912-33.5872 24.832-28.672 54.6816 5.6832 33.1776 47.4112 45.1072 61.1328 48.9984zM436.8896 158.0032c5.4784 0 18.0736 1.792 22.3744 6.8608 0.6144 0.7168 2.4064 2.816 1.4336 9.216a106.3424 106.3424 0 0 1-8.3456 10.752 97.28 97.28 0 0 0-8.8064 11.4688A20.48 20.48 0 0 0 450.56 224.1024a19.8656 19.8656 0 0 0 10.6496 3.072 20.48 20.48 0 0 0 17.5104-9.6256c0.7168-1.0752 3.3792-4.2496 5.12-6.3488 7.4752-8.8576 15.36-18.0224 17.1008-28.5184a51.2 51.2 0 0 0-10.24-44.3392c-18.2784-21.4528-50.7904-21.4016-54.4256-21.2992a20.48 20.48 0 0 0 0.8704 40.96zM293.6832 232.0896a20.48 20.48 0 1 0 26.0096 31.6416c17.4592-14.336 49.8688-40.96 56.32-84.4288C384.6656 124.928 338.7392 97.28 313.2928 90.0096a20.48 20.48 0 0 0-11.2128 39.424c3.9424 1.1776 38.5024 12.2368 33.6384 43.6224-3.8912 25.8048-22.8864 43.3152-42.0352 59.0336z" p-id="1844"></path></svg>'
        },
        link: 'https://springloach.github.io/' },
    ],

    search: {
      provider: 'local'
    },

    outline: {
      level: 'deep',
      label: '页面导航'
    },

    docFooter: {
      prev: '上一篇',
      next: '下一篇'
    }
  }
})
